Австралия/src/Catalogs/FinancialReportsItems/FinancialReportsItems.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>FinancialReportsItems</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.FinancialReportsTypes</owners>
  <attributes>
    <name>ItemType</name>
    <type>
      <types>EnumRef.FinancialReportItemsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrinting</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReverseSign</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalFilter</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>HasSettings</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AnalyticsValue</name>
    <type>
      <types>ChartOfAccountsRef</types>
    </type>
  </attributes>
  <attributes>
    <name>LinkedItem</name>
    <type>
      <types>CatalogRef.FinancialReportsItems</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemTypeAttributes</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.FinancialReportsItemsAttributes</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.FinancialReportsItemsAttributes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>FormulaOperands</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Operand</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TableItems</name>
    <attributes>
      <name>Row</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>Column</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalFields</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OutputTitle</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InSeparateColumn</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceItems</name>
    <attributes>
      <name>Appearance</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceAppliedAreaType</name>
      <type>
        <types>EnumRef.AppearanceAppliedAreasTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceAppliedRows</name>
    <attributes>
      <name>ReportItem</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceAppliedColumns</name>
    <attributes>
      <name>ReportItem</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceItemsFilterFieldsDetails</name>
    <attributes>
      <name>ReportItem</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>FilterFieldName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ResourceName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ValuesSources</name>
    <attributes>
      <name>Source</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AddedDocumentValues</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Enums/FinancialReportItemsTypes/FinancialReportItemsTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>FinancialReportItemsTypes</name>
  <enumValues>
    <name>ReportTitle</name>
  </enumValues>
  <enumValues>
    <name>NonEditableText</name>
  </enumValues>
  <enumValues>
    <name>EditableText</name>
  </enumValues>
  <enumValues>
    <name>AccountingDataIndicator</name>
  </enumValues>
  <enumValues>
    <name>UserDefinedFixedIndicator</name>
  </enumValues>
  <enumValues>
    <name>BudgetItem</name>
  </enumValues>
  <enumValues>
    <name>BudgetItemsAll</name>
  </enumValues>
  <enumValues>
    <name>BudgetIndicator</name>
  </enumValues>
  <enumValues>
    <name>BudgetIndicatorsAll</name>
  </enumValues>
  <enumValues>
    <name>UserDefinedCalculatedIndicator</name>
  </enumValues>
  <enumValues>
    <name>NonfinancialIndicator</name>
  </enumValues>
  <enumValues>
    <name>EditableValue</name>
  </enumValues>
  <enumValues>
    <name>TableIndicatorsInRows</name>
  </enumValues>
  <enumValues>
    <name>TableIndicatorsInColumns</name>
  </enumValues>
  <enumValues>
    <name>TableComplex</name>
  </enumValues>
  <enumValues>
    <name>TableItem</name>
  </enumValues>
  <enumValues>
    <name>Columns</name>
  </enumValues>
  <enumValues>
    <name>Rows</name>
  </enumValues>
  <enumValues>
    <name>ConfigureCells</name>
  </enumValues>
  <enumValues>
    <name>TableCell</name>
  </enumValues>
  <enumValues>
    <name>Dimension</name>
  </enumValues>
  <enumValues>
    <name>Group</name>
  </enumValues>
  <enumValues>
    <name>GroupTotal</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/ReportItemsAdditionalModes/ReportItemsAdditionalModes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ReportItemsAdditionalModes</name>
  <enumValues>
    <name>AllItemsInCompexTable</name>
  </enumValues>
  <enumValues>
    <name>AllIndicatorsInComplexTable</name>
  </enumValues>
  <enumValues>
    <name>TableItemInComplexTable</name>
  </enumValues>
  <enumValues>
    <name>TableItemInInputMode</name>
  </enumValues>
  <enumValues>
    <name>ItemInBudgetIndicator</name>
  </enumValues>
  <enumValues>
    <name>BudgetItemInInputMode</name>
  </enumValues>
  <enumValues>
    <name>ReportType</name>
  </enumValues>
  <enumValues>
    <name>ShowRowCodeAndNote</name>
  </enumValues>
  <enumValues>
    <name>LinkedItem</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/FinancialReportsItems/Forms/LinkedItem/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	Title = NStr("en = 'Link to a report item'; ru = 'Ссылка на элемент отчета';pl = 'Odnośnik do elementu raportu';es_ES = 'Enlace al elemento del informe';es_CO = 'Enlace al elemento del informe';tr = 'Rapor öğesine bağlantı';it = 'Collegamento a elemento report';de = 'Link zu einer Berichtsposition'");
	
	ObjectData = Catalogs.FinancialReportsItems.FormOnCreateAtServer(ThisObject);
	LinkedReportType = Object.LinkedItem.Owner;
	LinkedItemDescription = Object.LinkedItem.DescriptionForPrinting;
	Description = ObjectData.DescriptionForPrinting;
	If IsBlankString(LinkedItemDescription) And Not IsBlankString(Description) Then
		LinkedItemDescription = ObjectData.DescriptionForPrinting;
	EndIf;
	ItemTypes = Enums.FinancialReportItemsTypes;
	IsIndicator = (ObjectData.ItemType = ItemTypes.AccountingDataIndicator
		Or ObjectData.ItemType = ItemTypes.UserDefinedFixedIndicator
		Or ObjectData.ItemType = ItemTypes.UserDefinedCalculatedIndicator
		Or (ObjectData.ItemType = ItemTypes.GroupTotal And ObjectData.IsLinked));
	
	Items.ReverseSign.Visible = IsIndicator;
	Items.MarkItem.Visible = IsIndicator;
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	AddMode = Enums.ReportItemsAdditionalModes.LinkedItem;
	Catalogs.FinancialReportsItems.FormBeforeWriteAtServer(ThisObject, CurrentObject, Cancel, AddMode);
	
EndProcedure

&AtClient
Procedure BeforeClose(Cancel, StandardProcessing)
	
	If ValueIsFilled(ItemAddressInTempStorage) Then
		StandardProcessing = False;
	EndIf;
	
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)

	NativeLanguagesSupportServer.OnReadPresentationsAtServer(Object);
	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)

	NativeLanguagesSupportServer.OnReadPresentationsAtServer(Object);
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure DescriptionForPrintingOnChange(Item)
	
	Object.Description = Object.DescriptionForPrinting;
	
EndProcedure

&AtClient
Procedure CommentStartChoice(Item, ChoiceData, StandardProcessing)
	
	CommonClient.ShowCommentEditingForm(
		Item.EditText, 
		ThisObject, 
		"Object.Comment");
	
EndProcedure

&AtClient
Procedure LinkedItemClick(Item, StandardProcessing)
	
	StandardProcessing = False;
	
	FormParameters = New Structure;
	FormParameters.Insert("Key", LinkedReportType);
	FormParameters.Insert("CurrentReportItem", Object.LinkedItem);
	OpenForm("Catalog.FinancialReportsTypes.ObjectForm", FormParameters);
	
	Close();
	
EndProcedure

&AtClient
Procedure Attachable_Open(Item, StandardProcessing)
	NativeLanguagesSupportClient.OnOpen(ThisObject, Object, Item, StandardProcessing);
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure FinishEditing(Command)
	
	FinancialReportingClient.FinishEditingReportItem(ThisObject);
	
EndProcedure

#EndRegion
